{
  "base_model_name_or_path": "AntoineBlanot/t5-uNLU-large",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "lora_alpha": 32,
  "lora_dropout": 0.05,
  "modules_to_save": [
    "classif_head"
  ],
  "peft_type": "LORA",
  "r": 16,
  "target_modules": [
    "q",
    "v"
  ],
  "task_type": null
}