{
  "base_model_name_or_path": "AntoineBlanot/flan-t5-xxl-classif-3way",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "lora_alpha": 32,
  "lora_dropout": 0.05,
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 16,
  "target_modules": [
    "q",
    "v"
  ],
  "task_type": "SEQ_CLS"
}