{
  "_name_or_path": "AntoineBlanot/flan-t5-xxl-classif-3way",
  "architectures": [
    "T5ForClassification"
  ],
  "d_ff": 10240,
  "d_kv": 64,
  "d_model": 4096,
  "decoder_start_token_id": 0,
  "dense_act_fn": "gelu",
  "dropout_rate": 0.1,
  "eos_token_id": 1,
  "feed_forward_proj": "gelu",
  "initializer_factor": 1.0,
  "is_encoder_decoder": true,
  "is_gated_act": true,
  "layer_norm_epsilon": 1e-06,
  "model_type": "t5",
  "n_class": 3,
  "num_decoder_layers": 1,
  "num_heads": 64,
  "num_layers": 24,
  "output_past": true,
  "pad_token_id": 0,
  "relative_attention_max_distance": 128,
  "relative_attention_num_buckets": 32,
  "tie_word_embeddings": false,
  "torch_dtype": "float32",
  "transformers_version": "4.27.2",
  "use_cache": false,
  "vocab_size": 32128
}
